# Declare An Undeclared Project

> Declare ? NewDirection() : NewProject(null);

## 1 Mess & Mind

世界在逐渐消亡

死神如影随形

你想要逃离

但你不知道会逃向何方

世界终将消亡

死神其实不在你的身后

你最终无处可逃

原来死神在世界的尽头，等了你好久

## 2 Keywords？

> 生存、多周目、抉择、2D

## 3 写点儿接地气的

> 游戏地图在不断地崩溃，玩家需要不断地向下一个目的地逃亡，最终逃无可逃，Game Over。

对于上述说法，又有如下几点解释：

### 3.1 “下一个目的地”

这是一道决定生死的单选题，路线的选择决定了生存的时间。但 “活得更久”不一定就是最优解，每一个被你抛在身后的“落脚点”最终都将被末日吞噬，你必须弄清楚一件事，你并非在一个不毛之地狂奔，你会不断地相遇，然后道别。

### 3.2 试着带走些什么

或许你最终无法逃出死神的魔爪，又或许你会成为最终的生还者，那么你需要考虑是否带着某人或者某物一起逃亡，当然，这是有代价的，决定权始终在你的手上。

### 3.3 逃无可逃？

你可能是个悲观主义者，又或者不是，末日的脚步越来越急促，也许它终将追上你，又或者在这场追逐中，死神会比你更早筋疲力竭。

## 4 写点儿实际的

> 暂时没有更多了
